#!/user/bin/env python3
#coding=utf-8
import json
a_list=[[60001,100],[60002,100],[60101,100],[60102,100],[60103,100],[60104,100],[60111,100],[60201,100],[60202,100],[60301,100],[60302,100],[60303,100],[60304,100],[60401,100],[60402,100],[60501,100],[60502,100],[60503,100],[60601,100],[60602,100],[60603,100],[60604,100],[60605,100],[60701,100],[60702,100],[60703,100],[60704,100],[60705,100],[60706,100],[60801,100],[60802,100],[60804,100],[60901,100],[61201,100],[61202,100],[61203,100],[61204,100],[61301,100],[61302,100],[61303,100],[61401,100],[61402,100],[61501,100],[61502,100],[61504,100],[61505,100],[61701,100],[61702,100],[61903,100],[61904,100],[60305,100],[60504,100],[60606,100],[61205,100],[61506,100]]
a_list_split=[]
for i in a_list:
    a_list_split.append(i[0])
with open (r"E:\hero_js\config_json\hero.json","rb") as f:
    hero_data=json.load(f)
hero_list=[]
for j in hero_data:
    if hero_data[j]["visible"] == "1":
        hero_list.append(j)
print("a_list_split",a_list_split)
print("hero_list:",hero_list)
for k in a_list_split:
    if str(k) in hero_list:
        pass
    else:
        print(f"erro!!!{k}id配置错误，在hero表不存在！！！")
for l in hero_list:
    if int(l) in a_list_split:
        pass
    else:
        print(f"erro!!!{l}id配置错误，在全局表不存在！！！")